{"review": "[CLS] (Mild Spoilers) Frankie Machine had been dealt a bad hand in life. A card dealer at an illegal gambling den in his Chicago neighborhood he was busted when the joint was raided by the cops and given six months in jail. <br /><br />While behind bars Frankie was treated for his heroin addiction at the prisons hospital and learned how to play the drums as part of his rehabilitation program. Now out of prison and back in his old neighborhood Frankie is trying to put his life back together by getting a union card in the Musicians Union and then a job as a drummer in a band and put his old life behind him but instead it catches up with Frankie in no time at all in \"The Man with the Golden Arm\". <br /><br />Otto Preminger's ground-breaking 1955 film about heroin addiction with Frank Sinatra giving the performance of his life as the drug addicted card sharp Frankie Machine, the Man with the Golden Arm. Frankie tries to getaway from the life that he lead but has this monkey or, better yet, gorilla on his back that just won't let him. Soild performances by the entire supporting cast starting with Frankie's friend Sparrow, Arnold Stang. Sparrows attempt to get Frankie back on his feet by shoplifting a suit of clothes for him ends up putting him and Frankie in the slammer, and almost back to prison, until his former boss at the gambling den Schwiefka bailed him out. <br /><br />There's Frankie's psychically as well as emotionally crippled wife Zosch, Eleanor Parker, who sees that her hold on Frankie is slipping and is slowly driven to madness murder and suicide. There's Frankie's drug dealer Louie, with Darren McGavin in one of his first acting roles, who's hold on Frankie is only good as long as he stays addicted and Louie goes out of his way to make sure that he does. <br /><br />There's the owner of the gambling joint that Frankie works at as it's top card dealer Schwiefka, Robert Strauss, who like Louie goes out of his way to get Frankie back to work for him even though if he's arrested again Frankie's hopes for a new and better life will go down the drain. And then there's Frankie's next-door neighbor and friend Molly, Kim Novak,who goes to almost impossible lengths to get him over his addiction by locking him up in her apartment. It'[SEP]", "label": 1, "predicted": 0}
{"review": "[CLS] Even though this film was nothing special as such, I am drawn to comment on at least one factor that ruled in its favour - that of the lead female performer in the film, Dyan Cannon. In spite of the film's ridiculous storyline and what she goes through here, hers was the best acting job in the film, making the unbelievable seem more plausible. Her raucous scene with the gay photographer David Hemmings has to be seen to be believed. Good work, Dyan.[SEP][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD]", "label": 0, "predicted": 1}
{"review": "[CLS] 'Felony' is a B-movie. No doubt about it.<br /><br />Of course, if you take a look at the cast lineup you might have some high hopes for its entertainment potential. This film is stuffed with all of those wonderful character actors that you grew up with, the ones with the faces you immediately recognize even though you probably don't know their names. It's amazing that the filmmakers were able to get all of these people together on one project, almost like they decided to do a B-movie actor reunion. The cast even includes a couple of really first-rate actors: David Warner, who most people will recognize from 'Titanic' (although my favorite of his roles is Jack the Ripper in 'Time After Time') and Lance Henriksen, who many will remember as Bishop in 'Aliens'. These two actors have done some excellent work in their long careers and made some very fine films.<br /><br />However, as impressive as this collection of actors is, their talent is never fully manifested on the screen. The writers of 'Felony' spent a lot of money to assemble a dream-team cast and then missed their golden opportunity because of one important factor, the common denominator of all B-movies: a silly script.<br /><br />We start with a silly premise. The bad guys are caught on tape committing a gruesome murder and they relentlessly pursue the film crew in order to acquire the videotape and destroy the evidence. But honestly, why bother? In the time it takes them to track down the film crew, a thousand copies of that tape could be made and circulated to every law enforcement agency and media outlet. The criminals don't seem to realize how futile their effort is, and they talk as if stealing and destroying the one original videotape is going to solve the whole problem. Silly...but I suppose if the bad guys were so logical there would be no movie.<br /><br />Then there is the dialogue. It is at times silly, at times cliché, and at times unbelievable...everything you have come to expect from a B-movie. Of course, I have always believed that strong performances can overcome a lot of weaknesses in the material. This cast includes actors who are definitely capable of strong performances, and although a number of the cast members are not good actors at all and have achieved B-movie status quite deservedly, one still might be hopeful[SEP]", "label": 0, "predicted": 1}
{"review": "[CLS] Indeed, Cynthia Watros is in this movie as Elizabeth talking to Desmond. Though I'm just wondering how she ended up as a'rehab patient'(?) where Hurley is also in there trying to reduce his weight (as seen from the previous episodes).<br /><br />Anyway, this last episode is really suspended. The ending is not so understandable. I think the writer did expect the audience that there is a season 3 coming.<br /><br />I just hope the next season will give light to more unclear/hanging events that were happened.<br /><br />Just can't wait further for season 3.[SEP][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD]", "label": 1, "predicted": 0}
{"review": "[CLS] I love musicals, all of them, from joyous Oklahoma, to Poignant Porgy and Bess, to the touching romantic \"Damn Yankees.\" And I know most of the songs, sometimes singing them spontaneously, with a crowd or humming them alone.<br /><br />In a \"real\" musical, as differentiated from this vaudeville show, every song is painstakingly crafted to fit the exact moment. It is an expression of sadness, regret, love, joy or exaltation--a natural extension where mere words fail. So, in Guys and Dolls, \"My Time of Day\" describes the adventurous life of Sky Masterson as it is about to be compromised by the most unlikely woman. Every song in this brilliant exemplar of the genre sets a mood, or develops a character, creating a phantasmagoria of place, turned absolutely believable by the self disclosing evocations of song.<br /><br />For this lover of the Broadway Musical, and their adaptations to the screen during the last half of the 20th century, Mama Mia is somewhere between satire and a cruel fun house distortion of the genre. There, the songs of these musicals advanced the often elaborate, often delightful, plot lines. While here, the songs, simply picked up from a collection, only interfered with the shaky premise of the film.<br /><br />Perhaps most of those viewers who are making this film into a monumental success simply have no exposure to the art form of 20th century Musicals. They have no idea of the magic performed by writer and lyricist that can turn a dance hall floozy into someone whom we know and love, as achieved in \"Sweet Charity.\"<br /><br />Let me offer an apology for the arrogance of this review. Perhaps, another day, another mood, I could have gotten into it, and not have been so critical in this review.<br /><br />But I can't help but imagining what Richard Roger, Oscar Hammerstein, Cole Porter, Irving Berlin and so many others could have done even with with this silly premise. I think about it, while the memories of seeing this film is fresh, and I can not help but to mourn the great loss.[SEP][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD]", "label": 0, "predicted": 1}
{"review": "[CLS] \"Ordinary Decent Criminal\" is sort of based on the exploits of Martin Cahill, already the subject of John Boorman's 1998 film \"The General\". Cahill had a rough upbringing in a slum area and graduated from petty crime to armed robbery with honours. He justified his criminal career by pointing out his poor background at every opportunity. This is a common excuse for criminals that conveniently overlooks the thousands of slum-dwellers who don't turn to robbing post offices and selling guns in order to make ends meet. Cahill made fools of the police and local authorities, not to mention the IRA, which earned him a sort of \"Folk Hero\" status as well as making him many enemies. However, he was basically an amoral, self-serving thief.<br /><br />My primary problem with \"ODC\" is that the protagonist is made out to be a lovable Irish rogue. Kevin Spacey does a good job portraying Michael Lynch with a blend of oily charm and quiet menace, but the character is too amoral and selfish to be seen as any sort of hero, even an anti-hero. <br /><br />The film is well shot and well acted by a fine cast, but what lets it down is the script. Writer Gerard Stembridge can't make up his mind; is he writing an Irish \"Lock Stock\" or a grittier treatment of Martin Cahill's thieving career? That's the problem when a writer bases his central character on a real person. <br /><br />It's also unfortunate that \"ODC\" followed the cinema release of John Boorman's \"The General\", which was a more accurate portrayal of Martin Cahill's story. Cahill was a cunning thief who knew the value of good publicity, so it's not surprising that his exploits got the movie treatment.<br /><br />What IS surprising is that a studio was prepared to take Cahill's story and give it a happy Hollywood-style ending. Kevin Spacey's charismatic-twinkly-bigamist-thief Michael Lynch gets to ride off into anonymity on his motorcycle in \"ODC\". In the real world, Martin Cahill was executed by the IRA, just to prove that no-one makes fools of an out-dated, sectarian and corrupt para-military organisation and gets away with it. <br /><br />The real Cahill would never have walked away from his notoriety because it bolstered his \"[SEP]", "label": 0, "predicted": 1}
{"review": "[CLS] It was only the second year of the Academy but already they were voting politically - Jeanne Eagels' brilliant performance in this creaky early talkie had to make do with an Oscar nom and the statuette went to the worst performance ever to win - Mary Pickford's in COQUETTE. The only existing print was a work print without music or final editing, but wherever it's shown, Eagels stuns and captivates with her beguiling, powerful performance. She is so convincing on the witness stand that while we know she is lying through her teeth (we did after all SEE her kill the man), we in the audience find ourselves, like the jurors, believing in her innocence, before we suddenly catch ourselves. THAT is GREAT ACTING. The film needs to be made available on video so that the world can enjoy this terrific performance again. (One silent of Jeanne's exists in archive print - MAN, WOMAN AND SIN - and her only other talkie, JEALOUSY, is \"lost,\" so this is the only document we have of her. Run to see it (when it first came out of the archives to be shown in NYC in the early 70s, the Village Voice printed a full page review, worshipping the Eagels performance).[SEP][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD]", "label": 0, "predicted": 1}
{"review": "[CLS] Before Stan Laurel became the smaller half of the all-time greatest comedy team, he laboured under contract to Broncho Billy Anderson in a series of cheapies, many of which were parodies of major Hollywood features. Most of Laurel's 'parody' films are only mildly funny, and even less funny for modern audiences who haven't seen the original movie which Laurel is parodying. Fortunately, 'Mud and Sand' lampoons a movie which is still well known: 'Blood and Sand', starring Rudolph Valentino. 'Blood and Sand' was released only nine weeks before this parody, giving you some idea of how quickly Broncho Billy's movies were ground out, edited and distributed.<br /><br />Various sources (including IMDb) state that Stan Laurel's character in this film is named Rhubarb Vaselino, with a final 'o'. I've screened a print of 'Mud and Sand' with the original titles (in Hobo type font), so I report that Laurel's role is actually cried Rhubarb Vaseline, with an 'e'. But I agree that 'Vaselino' is funnier. Laurel copies the elaborate sideburns which Valentino wore in 'Blood and Sand' (he should've made them longer!), and there's a parody of Valentino's dressing scene from that movie, which made female movie-goers swoon in 1922. A señorita named Carmen in the original film is parodied here as Caramel (a girl I'd like to sink my teeth into).<br /><br />This movie (like the original) apparently takes place in Spain, yet there's a Prohibition gag. Laurel uses a distinctive hat-tipping gesture here which could have become a trademark for him (like Hardy's distinctive necktie twiddle), but I've never spotted it in any other Laurel film. There's some amusing dialogue: Rhubarb Vaseline tells the other matadors to 'Save a bull for me.' When Vaseline becomes a successful toreador, a lackey tells him 'The bull is without, sir'... which is funny, but I was disappointed that Laurel didn't reply 'Without WHAT?'.<br /><br />There's one funny moment here which almost certainly wasn't planned, when Vaseline shows up for the bullfighter auditions. Laurel swaggers into the bullring, and -- before you can say 'corrida querida' -- he tosses a[SEP]", "label": 0, "predicted": 1}
{"review": "[CLS] First, I'm a huge Buddy Holly fan. I grew up knowing who he was, and I knew all about that fateful plane ride that extinguished three incredibly bright flames just like that. But I had never truly listened to his music. I had heard much of it, yes, but not until I sat down with the intention of getting something out of it did I truly come to see the real Buddy Holly. And let me tell you that my world is a different one now because of him.<br /><br />Because of this adoration for such an incredible man, I bought The Buddy Holly Story without ever seeing it previously. I'm torn on my views of this film. Perhaps it's because Buddy feels so alive to me that I just couldn't bear seeing Gary Busey in this role. I'll admit that he did a nice job acting, but his singing sounded so forced. It seemed to me as if he knew he didn't sound a bit like Buddy himself and therefore was using far too much energy to make an attempt at a similar sound. In some parts of the film, he succeeded. But others.. ouch.<br /><br />The movie spanned a period of several years, but I feel that portraying this time span could have been handled much better. I had a difficult time distinguishing at what point in Buddy's life certain events were happening. I also had a serious problem with some of the historical inaccuracies. I think the worst one was the portrayal of the Crickets. I understand how their real names couldn't be used, and how for simplification there were only two of them in the movie.. and maybe this was a good thing. Because the film's background vocals were cringe-worthy, and I disliked the way they were portrayed as a hindrance to Buddy's career. Something else that really made no difference to the film but irked me was Gary Busey's teeth. They wore me out! Buddy Holly had much better teeth. I don't know why I noticed it.. but I did.<br /><br />I'll end this review on what I felt was the best part of the movie: Buddy's last performance. His final phone call to Maria, the Big Bopper's performance, bringing him and Richie Valens to the stage, followed by the still frame ending. It startled even me, and I feel that it effectively shows the audience how at one moment Buddy Holly[SEP]", "label": 1, "predicted": 0}
{"review": "[CLS] This movie is total dumbness incarnate. Yet, i've seen this movie several times already and plan to watch several more times because, despite its sheer dumbness, it's very entertaining. And it has one of my favorite hokey-movie actors, Casper van Dien, who is here in his full hokey-movie glory. Here, Casper van Dien is fully Casper van Dien, and ya gotta love him for it. If he hadn't been in this movie, it would have been totally unwatchable dreck, or at least far dreckier than it already is.<br /><br />The (cough cough) \"science\" used here makes absolutely no sense at all. No one else in the world noticed that big asteroid approaching the Earth besides that small group? Not even with thousands and thousands and thousands of professional and amateur astronomers constantly searching the skies for just such a thing? An asteroid that big would have made itself completely obvious to anyone who has a pair of eyes even vaguely capable of sight. And a chunk of the asteroid bounced off the atmosphere and no one even noticed it? A rock that big hitting the atmosphere would have caused enormous shockwaves that would have in turned caused an enormous amount of damage to the planet's surface. Surely, someone would have noticed such a thing. Bwahahaha! The \"science\" used in this movie is so completely ridiculous, that, somehow it works for making this movie as entertaining as it is.<br /><br />One thing i noticed is that despite the uber heat, all the characters weren't dripping with sweat and their clothes completely soaked with it. At the most, the characters looked like they had been lightly spritzed on occasion by someone off-camera with a water bottle to give a \"sweat sheen\". Authenticity was *not* a goal that this movie assiduously and constantly strived for. Which, in a weird and hilarious sort of way, gives this movie its entertainment charm.<br /><br />Is this movie actually worth watching? Definitely! Assuming, of course, you have absolutely *no* expectations of anything that even remotely approaches reality. And, it's your desire to wallow and luxuriate in total hokeyness at the moment.[SEP][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD][PAD]", "label": 0, "predicted": 1}
